{
    "todos": [
        "Buy groceries for the week.",
        "Finish reading a book.",
        "Pay bills before due date.",
        "Call mom to wish happy birthday.",
        "Schedule dentist appointment.",
        "Clean the garage and organize tools.",
        "Write a blog post about recent trip.",
        "Start a new workout routine.",
        "Research and book a vacation.",
        "Attend a yoga class at local studio.",
        "Complete a coding tutorial.",
        "Update resume and apply for jobs.",
        "Send email to client about project updates.",
        "Plan a surprise party for a friend.",
        "Take car for oil change and maintenance check.",
        "Declutter closet and donate unused clothes.",
        "Create meal plan for the upcoming week.",
        "Fix leaky faucet in the bathroom.",
        "Learn to play a new musical instrument.",
        "Volunteer at local charity event.",
        "Explore hiking trail in the nearby park.",
        "Try a new restaurant in town.",
        "Write a poem or short story.",
        "Plant flowers or herbs in the garden.",
        "Organize digital files and folders.",
        "Take a dance class and learn new moves.",
        "Try a new recipe and cook from scratch.",
        "Read a classic novel or literature.",
        "Create a budget and track expenses.",
        "Learn to meditate and practice mindfulness.",
        "Take a photography course and capture moments.",
        "Attend a live music concert or performance.",
        "Visit a museum and explore the exhibits.",
        "Learn a new language or practice language skills.",
        "Start a gratitude journal and write daily.",
        "Take a road trip to a nearby city.",
        "Try a new form of exercise or fitness class.",
        "Plan a picnic in the park with friends.",
        "Learn to knit or crochet and create handmade items.",
        "Volunteer at a local soup kitchen or shelter.",
        "Write and send thank-you notes to loved ones.",
        "Explore a new hobby, like painting or woodworking.",
        "Learn to code and build a simple website.",
        "Go for a bike ride and explore the neighborhood.",
        "Plan a movie night with friends and watch a classic film.",
        "Research and try a new style of yoga or fitness.",
        "Take a cooking class to learn new techniques.",
        "Attend a workshop or conference in your field.",
        "Start a DIY project and repurpose old items.",
        "Practice a musical instrument for 30 minutes daily.",
        "Try a new type of tea or coffee blend.",
        "Take a scenic hike and enjoy nature's beauty.",
        "Visit a local farm or farmer's market.",
        "Learn to sew and create your own clothes or accessories.",
        "Join a local book club and discuss favorite books.",
        "Explore a nearby beach or lake for relaxation.",
        "Learn to do a new style of dance, like salsa or hip-hop.",
        "Take a yoga retreat for relaxation and rejuvenation.",
        "Start a journaling practice for self-reflection.",
        "Learn to make homemade soap or candles.",
        "Join a local sports team or recreational league.",
        "Experiment with different art mediums, like watercolor or sculpture.",
        "Learn to do basic car maintenance tasks.",
        "Create a personalized playlist for different moods.",
        "Take a day trip to a nearby historical site.",
        "Try a new form of exercise, like Pilates or kickboxing.",
        "Visit a botanical garden and admire the flora.",
        "Learn to make your favorite restaurant dish at home.",
        "Start a YouTube channel to share your interests or tutorials.",
        "Practice mindful eating and savor each bite.",
        "Take a weekend getaway to a scenic destination.",
        "Join a local charity or volunteer organization.",
        "Learn to do basic home repairs or improvements.",
        "Take a creative writing class and explore your writing skills.",
        "Try a new type of cuisine from a different culture.",
        "Start a daily exercise routine for better fitness.",
        "Explore a nearby national park or nature reserve.",
        "Learn to make homemade pasta or bread from scratch.",
        "Join a photography club and participate in photo walks.",
        "Take a mindfulness retreat for self-care and stress relief.",
        "Learn to create digital illustrations or graphic designs.",
        "Go camping and spend time in nature.",
        "Try a new form of dance, like belly dancing or tango.",
        "Start a virtual book club with friends or colleagues.",
        "Explore a new hobby, like rock climbing or pottery.",
        "Learn to play a new card game or board game.",
        "Take a wine tasting class and discover new flavors.",
        "Practice daily affirmations for positive mindset.",
        "Try a new hair or makeup style for a fresh look.",
        "Learn to make your own natural skincare products.",
        "Join a local hiking or outdoor adventure group.",
        "Take a cooking class focused on international cuisine.",
        "Start a podcast to share your knowledge or interests.",
        "Learn to do basic home plumbing repairs.",
        "Attend a local theater performance or play.",
        "Try a new type of dessert or baking technique.",
        "Join a writing workshop or critique group.",
        "Take a day trip to a nearby winery or vineyard.",
        "Learn to create digital music or DJing."
    ]
}